In [1]:
people = {
    'name' : ['Aslan', 'Zhuldyz', 'Azamat', 'Kamila'],
    'surname' : ['Tolegazinov', 'Gabitova', 'Bolatov', 'Hamitova'],
    'email' : ['aslan.tol@gamil.com', 'zhuldyz99@gmail.com', 'azamat.g@mail.ru', 'kami.hamitova@yandex.ru']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

      name      surname                    email
0    Aslan  Tolegazinov      aslan.tol@gamil.com
1  Zhuldyz     Gabitova      zhuldyz99@gmail.com
2   Azamat      Bolatov         azamat.g@mail.ru
3   Kamila     Hamitova  kami.hamitova@yandex.ru

In [5]:
df['name'] + " " + df['surname']

0    Aslan Tolegazinov
1     Zhuldyz Gabitova
2       Azamat Bolatov
3      Kamila Hamitova
dtype: object

In [6]:
df

      name      surname                    email
0    Aslan  Tolegazinov      aslan.tol@gamil.com
1  Zhuldyz     Gabitova      zhuldyz99@gmail.com
2   Azamat      Bolatov         azamat.g@mail.ru
3   Kamila     Hamitova  kami.hamitova@yandex.ru

In [7]:
df['full name'] = df['name'] + " " + df['surname']

In [8]:
df

      name      surname                    email          full name
0    Aslan  Tolegazinov      aslan.tol@gamil.com  Aslan Tolegazinov
1  Zhuldyz     Gabitova      zhuldyz99@gmail.com   Zhuldyz Gabitova
2   Azamat      Bolatov         azamat.g@mail.ru     Azamat Bolatov
3   Kamila     Hamitova  kami.hamitova@yandex.ru    Kamila Hamitova

In [9]:
df.drop(columns = ['name', 'surname'])

                     email          full name
0      aslan.tol@gamil.com  Aslan Tolegazinov
1      zhuldyz99@gmail.com   Zhuldyz Gabitova
2         azamat.g@mail.ru     Azamat Bolatov
3  kami.hamitova@yandex.ru    Kamila Hamitova

In [10]:
df

      name      surname                    email          full name
0    Aslan  Tolegazinov      aslan.tol@gamil.com  Aslan Tolegazinov
1  Zhuldyz     Gabitova      zhuldyz99@gmail.com   Zhuldyz Gabitova
2   Azamat      Bolatov         azamat.g@mail.ru     Azamat Bolatov
3   Kamila     Hamitova  kami.hamitova@yandex.ru    Kamila Hamitova

In [12]:
df.drop(columns=['name', 'surname'], inplace = True)

In [13]:
df

                     email          full name
0      aslan.tol@gamil.com  Aslan Tolegazinov
1      zhuldyz99@gmail.com   Zhuldyz Gabitova
2         azamat.g@mail.ru     Azamat Bolatov
3  kami.hamitova@yandex.ru    Kamila Hamitova

In [15]:
df['full name'].str.split(' ')

0    [Aslan, Tolegazinov]
1     [Zhuldyz, Gabitova]
2       [Azamat, Bolatov]
3      [Kamila, Hamitova]
Name: full name, dtype: object

In [16]:
df['full name'].str.split(' ', expand=True)

         0            1
0    Aslan  Tolegazinov
1  Zhuldyz     Gabitova
2   Azamat      Bolatov
3   Kamila     Hamitova

In [17]:
df[['name', 'surname']] = df['full name'].str.split(' ', expand = True)

In [18]:
df

                     email          full name     name      surname
0      aslan.tol@gamil.com  Aslan Tolegazinov    Aslan  Tolegazinov
1      zhuldyz99@gmail.com   Zhuldyz Gabitova  Zhuldyz     Gabitova
2         azamat.g@mail.ru     Azamat Bolatov   Azamat      Bolatov
3  kami.hamitova@yandex.ru    Kamila Hamitova   Kamila     Hamitova

In [22]:
df.append({'first':'Nariman'}, ignore_index=True)

                     email          full name     name      surname    first
0      aslan.tol@gamil.com  Aslan Tolegazinov    Aslan  Tolegazinov      NaN
1      zhuldyz99@gmail.com   Zhuldyz Gabitova  Zhuldyz     Gabitova      NaN
2         azamat.g@mail.ru     Azamat Bolatov   Azamat      Bolatov      NaN
3  kami.hamitova@yandex.ru    Kamila Hamitova   Kamila     Hamitova      NaN
4                      NaN                NaN      NaN          NaN  Nariman

In [23]:
people = {
    'name' : ['Tony', 'Steve'],
    'surname' : ['Stark', 'Jobs'],
    'email' : ['tony.stark@gamil.com', 'steve.j@gmail.com']
}

In [24]:
df2 = pd.DataFrame(people)
df2

    name surname                 email
0   Tony   Stark  tony.stark@gamil.com
1  Steve    Jobs     steve.j@gmail.com

In [30]:
df.append(df2, ignore_index = True)

                     email          full name     name      surname
0      aslan.tol@gamil.com  Aslan Tolegazinov    Aslan  Tolegazinov
1      zhuldyz99@gmail.com   Zhuldyz Gabitova  Zhuldyz     Gabitova
2         azamat.g@mail.ru     Azamat Bolatov   Azamat      Bolatov
3  kami.hamitova@yandex.ru    Kamila Hamitova   Kamila     Hamitova
4     tony.stark@gamil.com                NaN     Tony        Stark
5        steve.j@gmail.com                NaN    Steve         Jobs

In [31]:
df = df.append(df2, ignore_index = True)

In [32]:
df

                     email          full name     name      surname
0      aslan.tol@gamil.com  Aslan Tolegazinov    Aslan  Tolegazinov
1      zhuldyz99@gmail.com   Zhuldyz Gabitova  Zhuldyz     Gabitova
2         azamat.g@mail.ru     Azamat Bolatov   Azamat      Bolatov
3  kami.hamitova@yandex.ru    Kamila Hamitova   Kamila     Hamitova
4     tony.stark@gamil.com                NaN     Tony        Stark
5        steve.j@gmail.com                NaN    Steve         Jobs

In [35]:
df.drop(index = 4, inplace = True)

In [36]:
df

                     email          full name     name      surname
0      aslan.tol@gamil.com  Aslan Tolegazinov    Aslan  Tolegazinov
1      zhuldyz99@gmail.com   Zhuldyz Gabitova  Zhuldyz     Gabitova
2         azamat.g@mail.ru     Azamat Bolatov   Azamat      Bolatov
3  kami.hamitova@yandex.ru    Kamila Hamitova   Kamila     Hamitova
5        steve.j@gmail.com                NaN    Steve         Jobs

In [40]:
df.drop(df[df['email'] == 'aslan.tol@gamil.com'].index, inplace = True)

In [41]:
df

                     email         full name     name   surname
1      zhuldyz99@gmail.com  Zhuldyz Gabitova  Zhuldyz  Gabitova
2         azamat.g@mail.ru    Azamat Bolatov   Azamat   Bolatov
3  kami.hamitova@yandex.ru   Kamila Hamitova   Kamila  Hamitova
5        steve.j@gmail.com               NaN    Steve      Jobs